"""
Задание 1.

Поработайте с переменными, создайте несколько, выведите на экран.
Запросите у пользователя некоторые числа и строки и сохраните в
переменные, затем выведите на экран.
"""
print("Здравствуйте!")
name = input("Введите ваше имя: ")
age = int(input("Введите Ваш возраст: "))
print(f"Привет, {name}! Твой возраст - {age}")
